using System;

// Напишете програма, която отпечатва три числа в три виртуални колони на конзолата. Всяка колона трябва да е с широчина 10 символа, 
// а числата трябва да са ляво подравнени. Първото число трябва да е цяло число в шестнадесетична бройна система, второто да е дробно положи­телно, 
// а третото – да е дробно отрицателно. Последните две числа да се закръглят до втория знак след десетичната запетая.

class Program
{
    static void Main()
    { 
        double x = 12.3e3; //12300 = 12.3 * 10 ^ 3 10 1.0e1
        Console.WriteLine("{0,-10:X}{1,-10:F2}{2,-10:F2}", 10, 12.4,-23.78);
    }
}

